#Рецензия   (DetkovaLalib.h)

Предметом анализа является библиотека DetkovaLalib.h написанная на языке программирования С/C++
с использованием графической библиотеки TXLib.h. Программа представляет из себя комплекс функций, которые могут
 использоваться в дальнейшем для разработки программ при изучении процедурной анимации детьми в школах.

 Автором данной библиотеки является учитель информатики - *Деткова Людмила*.

**SDK DetkovaLalib** - представляет собой полный комплект необходимых средств разработки. В него входят:

- библиотека с функциями DetkovaLaLib.h
- программа анимация DetkovaLa_MULT.cpp
- два примера использования функций представленной библиотеки, Example1.cpp и Example2.cpp
- файл с конфигурациями Doxygen для формирования документации к библиотеке и файлам.

Кроме того, есть в наличии README – где дается описание этапов написания основной
программы анимации DetkovaLa_MULT.cpp.
Данный комплект находится в репозитории GitHub
[SDK DetkovaLalib](https://github.com/DetkovaLudmila/KPK_Multik.git)

##Библиотека DetkovaLalib.h содержит следующие функции:

DrawHowse()
DrawSun()
DrawGirl()
DrawBoy()
DrawCat()
DrawFlower()
DrawGrib()
DrawTree()
DrawKust()
DrawRain()

Герои  и другие объекты прорисованы качественно, используется приятная палитра цветов.
Параметры в функциях понятны и позволяют сделать анимацию некоторых объектов достаточно разнообразной.

Из всех функций хочется выделить следующие:

>Функция DrawHowse(), рисует домик, большое количество параметров.
Домики разного размера, с разными крышами, параметры размера окон и трубы,
параметры, позволяющие выбирать разные цвета для разных частей дома -
вполне хороший набор для рисования скопления различных домов с открывающимися дверьми!

>DrawSun(), рисует солнце. Солнце, которое может улыбаться, подмигивать, менять длину лучей
и зардеться большим румянцем, это то, что детям точно понравится. Солнце может менять цвет. Закат? Легко!

>DrawGirl() и DrawBoy() функции рисования девочки и мальчика. Обе функции похожи, содержат большое
количество параметров. Есть параметры, управляющие мимикой лица: изменение размера глаз, движение носа,
бровей и линии рта.  Вариации цвета волос, туловища. Движение конечностей. Хочу отметить, что из-за оригинальной
прорисовки ног, используя параметры движения можно добиться весьма замысловатых и забавных движений.

>DrawTree() - рисует привычную елочку (из треугольников). Позволяет нарисовать скопление     деревьев разного размера и цвета.
Качание большого количества елок (благодаря параметру) создает эффект непогоды и выглядит достаточно эффектно.
Думаю, это хороший способ демонстрации возможностей параметров при анимации простого геометрического объекта.

>Особо надо отметить функцию DrawCat(), функция рисует кошку (по сценарию оригинального мультика – это кошка с котятами).
Много параметров, но параметр движения ног и конструкция самого объекта, позволили автору сделать анимацию передвижения зверька
совершенно естественным способом на 4-х лапках. Это то,  на что стоит обратить внимание!

Другие функции, рисующие “вспомогательные” объекты, тоже нарисованы отлично и вполне гармоничны (грибочки, цветочки, облака, …. ).

!В целом комплекс совершенно рабочий и отчетливо можно наблюдать, что он реализовывался с учетом всех рекомендаций преподавателя КПК.

Если говорить о доработке библиотеки, то это могут быть незначительные корректировки совершенно рекомендательного характера.
Например,  можно  автору посоветовать убрать warnings, коих большое количество при компиляции, так как в целом они создают
впечатление недоработанности проекта. Кроме того, в названиях функций используются английские слова, когда как в названиях
параметров можно встретить и транслит и английские слова.  Нужно ли соблюдать единообразный формат  в названиях? Возможно это
спорный вопрос, так как детям может не хватать вокабуляра английских слов. Но есть уверенность, что автор может использовать
полностью английские слова и соблюсти однообразие. Если в этом есть необходимость.


Как результат использования данного SDK в своем проекте, хочется отметить, что работать с данной библиотекой было очень легко и приятно.
Благодаря правильной и интуитивно понятной структуре данной библиотеки, можно легко использовать функции в различных анимациях.


Если сделать вывод в целом, о самом процессе использования чужой библиотеки, в процессе освоения  SDK пришло понимание,
что есть необходимость в описании функций указывать (возможно и условные) границы значений параметров объектов.
Это очень сильно влияет на скорость интеграции пользователя при использовании чужого SDK и дает необходимый эффект предсказуемости.

Абрамова Ирина 19.05.2021
